testingsoap/bin/Debug/config.ini

--NAME
Country Information Webservice
--IP
62.177.194.231
--METHOD
List of Continents By name
POST /websamples.countryinfo/CountryInfoService.wso HTTP/1.1
Host: webservices.oorsprong.org
Content-Type: text/xml; charset=utf-8
Content-Length: 435

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ListOfContinentsByName xmlns="http://www.oorsprong.org/websamples.countryinfo">
    </ListOfContinentsByName>
  </soap:Body>
</soap:Envelope>
--END
--METHOD
List contentinents again
POST /websamples.countryinfo/CountryInfoService.wso HTTP/1.1
Host: webservices.oorsprong.org
Content-Type: text/xml; charset=utf-8
Content-Length: 435

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ListOfContinentsByName xmlns="http://www.oorsprong.org/websamples.countryinfo">
    </ListOfContinentsByName>
  </soap:Body>
</soap:Envelope>
--END
--NAME
World Series 2010
--IP
84.241.178.200
--METHOD
List all players
POST /data/info.wso HTTP/1.1
Host: footballpool.dataaccess.eu
Content-Type: text/xml; charset=utf-8
Content-Length: length 

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AllPlayerNames xmlns="http://footballpool.dataaccess.eu">
      <bSelected>boolean</bSelected>
    </AllPlayerNames>
  </soap:Body>
</soap:Envelope>
--END